ИТ_Фирма/src/Documents/СписаниеДенежныхСредств/СписаниеДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеДенежныхСредств</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетСКонтрагентами</registerRecords>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:Document>

ИТ_Фирма/src/AccumulationRegisters/ВзаиморасчетСКонтрагентами/ВзаиморасчетСКонтрагентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетСКонтрагентами</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ИТ_Фирма/src/Documents/СписаниеДенежныхСредств/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВзаиморасчетСКонтрагентами.Записывать = Истина;
	ДвиженияВзаиморасчет = Движения.ВзаиморасчетСКонтрагентами.Добавить();
	ДвиженияВзаиморасчет.ВидДвижения = ВидДвиженияНакопления.Расход;
	ДвиженияВзаиморасчет.Контрагент = Получатель;
	ДвиженияВзаиморасчет.Сумма = Сумма;
	ДвиженияВзаиморасчет.Период = Дата;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = СотрудникиВызовСервера.СотрудникТекущегоПользователя();
	
КонецПроцедуры
